# CwpCopyFloorInserts Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpCopyFloorInserts Property
ParameterTypeId Class See Also
---
"Copy openings/inserts"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpCopyFloorInserts { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpCopyFloorInserts As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpCopyFloorInserts {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace